## Django REST Framework란

<br>

### 1. Django REST Framework란

<br>

## 1) REST란

REST란 http의 url과 method를 사용해서 API 가독성을 높인 구조화된 시스템 아키텍쳐이다.

스마트폰이 출시되기 전에는 웹 페이지를 보여주는 웹 서버만 구현하면 되었다. 웹 서버에서 DB 서버의 데이터를 읽어오고, 사용자들이 글을 남기면 DB 서버에 저장까지 하는 기능을 모두 담당했다. 하지만 스마트 폰 출시 이후, 어플리케이션의 등장으로 더 이상 웹으로 서비스를 제공하는 것에 한계가 생겼다.

따라서 HTML로 렌더링 하는 웹 서버가 아닌, JSON 혹은 XML과 같은 형식을 통해서 데이터를 다루는 별도의 API 서버가 필요했다. 따라서 RESTful 아키텍쳐를 HTTP Method와 함께 사용해 웹, 데스트탑 웹, 스마트폰 앱들까지 하나의 API 서버를 생성할 수 있다.


<br>

### 2) DRF(Django REST Framework)

DRF란 Django 안에서 RESTful API 서버를 쉽게 구축할 수 있도록 도와주는 오픈 소스 라이브러리이다.

DRF를 사용하는 이유는 아래와 같다.

- 웹 브라우저 API는 범용성이 크다. 개발을 쉽게 만들어 준다.
- 인증 정책에 OAuth1, OAuth2를 위한 추가적인 패키지가 추가되어 있는 경우
- 시리얼라이즈 기능을 제공해준다. (DB data -> JSON)
- 문서화 및 커뮤니티 지원이 잘 되어있다.
